{
  "profile": {
    "name": "Ajinkya Bijwe",
    "title": "Assistant Vice President - Citi India",
    "description": "I'm a results-driven full-stack developer with over 9+ years of experience crafting cutting-edge applications and streamlining database systems. My expertise lies in rapidly prototyping solutions and modernising legacy frameworks to unlock enhanced performance and superior user experiences.",
    "avatar": "AB",
    "location": "Pune, India",
    "availability": "Full-time, Remote",
    "experience": "9+ Years",
    "languages": "English, Marathi (Native), Hindi",
    "avatarUrl": "https://avatars.githubusercontent.com/u/8812357?v=4",
    "resumeUrl": "https://drive.google.com/file/d/1FhMaiifzt5_fM2IyxHQA4EAYkHrN0hp4/view?usp=sharing"
  },
  "experience": [
    {
      "designation": "Assistant Vice President",
      "company": "Citi Inc.",
      "link": "https://www.citi.com/",
      "time": "2021 - Present",
      "location": "Pune, IN",
      "location_link": "https://www.google.com/maps/place/Pune,+Maharashtra/@18.5245649,73.7228812",
      "description": [
        "Currently involved in a large-scale project consisting of hundreds of modules, where I actively contribute and collaborate to ensure seamless functionality and timely delivery.",
        "Successfully developed a custom UI library and components, utilizing advanced rendering techniques, to enhance the user interface and provide reusable and efficient solutions for component rendering. This initiative has significantly improved development speed and ensured consistency across the project.",
        "Designed and created relational diagrams using d3.js, a powerful JavaScript library for data visualization, to present complex data in an intuitive and visually appealing manner.",
        "Effectively utilized reactive components and the NGRX library to render sensitive data in a secure and controlled manner. By leveraging these technologies, I have ensured data privacy and implemented necessary measures to protect sensitive information."
      ]
    },
    {
      "designation": "Sr. Full Stack Developer",
      "company": "Cognizant Technology Solutions",
      "client": "Verizon Inc.",
      "link": "https://www.cognizant.com/in/en",
      "time": "2019 - 2021",
      "location": "Tampa, US & Pune, IN",
      "location_link": "https://www.google.com/maps/place/Tampa,+FL/@27.9944116,-82.5943635,11z",
      "description": [
        "Designed and developed the complete UI architecture for the Verizon Northstar application, encompassing various network components and modules.",
        "Developed custom modules that dynamically generate network diagrams and establish connections based on API data, resulting in improved visualization and enhanced user experience.",
        "Demonstrated expertise in implementing an efficient caching mechanism using the ngRX reactive library to store and retrieve dynamic data, enhancing application performance.",
        "Designed and implemented a robust shopping cart model, enabling the creation and management of orders, as well as the ability to add/remove network components. Effectively tracked in-progress orders, ensuring smooth order management.",
        "Successfully integrated WebSocket technology to capture real-time events and messages, facilitating the reloading and repopulation of network components. This implementation enhanced the application's responsiveness and provided a seamless user experience."
      ]
    },
    {
      "designation": "Full Stack Engineer",
      "company": "Technumen Inc.",
      "client": "Verizon Inc.",
      "link": "https://www.verizon.com/",
      "time": "2018 - 2019",
      "location": "Tampa, US",
      "location_link": "https://www.google.com/maps/place/Tampa,+FL/@27.9944116,-82.5943635,11z",
      "description": [
        "Upgraded and redesigned Verizon Fiber Inventory Management application, encompassing multiple modules, from Angular version 1 to 10, while migrating codebase from JavaScript to Typescript.",
        "Received special recognition from both clients and employers for achieving a remarkable 40% enhancement in application reliability and loading speed, along with improved map rendering capabilities.",
        "Spearheaded the development and migration of existing JavaScript and Java web applications, introducing new map layers, Angular directives, services, and controllers. Leveraged Google Maps API to dynamically showcase data within the map interface.",
        "Demonstrated proficiency in creating responsive web pages, enhancing user-friendliness, and utilizing Adobe Illustrator and Moqups for wireframing. Collaborated with the team to gather feedback and incorporate design changes effectively."
      ]
    },
    {
      "designation": "Software Engineer",
      "company": "Larsen and Toubro Infotech Ltd.",
      "client": "Citi Inc.",
      "link": "https://www.larsentoubro.com/",
      "time": "2016 - 2018",
      "location": "Charlotte, US",
      "location_link": "https://www.google.com/maps/place/Charlotte,+NC/@35.2030728,-80.9799114,11z",
      "description": [
        "Developed recursive JavaScript modules, including Angular UI grid and Angular JSON Explorer for Citi Insight application enabling dynamic and recursive data display.",
        "Integrated various external JavaScript and Angular libraries, such as Underscore, Chart, and Angular Bootstrap, to leverage dynamic data from APIs and enhance the project's UI rendering capabilities.",
        "Utilized Object-Oriented JavaScript concepts extensively, incorporating object manipulation, inheritance, mix-ins, static inheritance, and additional utilities for improved handling of objects and arrays.",
        "Played a key role in onboarding resources and facets (informational blocks) into the application's server-side database, ensuring seamless integration and efficient data management."
      ]
    }
  ],
  "education": [
    {
      "degree": "Master of Science",
      "major": "Computer Science",
      "university": "California State University, Fullerton",
      "location": "Fullerton, US",
      "duration": "2014-2016",
      "gpa": 3.64,
      "max_gpa": 4.0,
      "description": "Completed a comprehensive curriculum in computer science, focusing on advanced topics such as algorithms, data structures, and software engineering principles. Engaged in hands-on projects and research to apply theoretical knowledge to real-world scenarios."
    },
    {
      "degree": "Bachelor of Engineering",
      "major": "Computer Science",
      "university": "Amravati University",
      "location": "Amravati, IN",
      "duration": "2009-2013",
      "gpa": 3.8,
      "max_gpa": 4.0,
      "description": "Acquired a solid foundation in computer science principles, programming languages, and software development methodologies. Participated in various projects and internships to gain practical experience in the field."
    }
  ],
  "skills": {
    "technical": [
      {
        "name": "Programming Languages",
        "description": ["JavaScript", "Typescript", "Python", "HTML5", "CSS/SCSS"]
      },
      {
        "name": "Databases",
        "description": ["MySQL", "PostgreSQL", "MongoDB", "Oracle"]
      },
      {
        "name": "JS Libraries & Frameworks",
        "description": [
          "Angular",
          "React",
          "Vue",
          "Node JS",
          "NPM Packages",
          "Ionic",
          "Google Maps API",
          "Open Street Maps",
          "Mapbox JS API",
          "NgRx",
          "Jasmine",
          "Karma",
          "Chart JS",
          "Bootstrap"
        ]
      },
      {
        "name": "Deployment Servers",
        "description": ["Amazon AWS Cloud", "Google Cloud", "Jenkins", "Google Firebase", "Heroku", "Cloudinary"]
      },
      {
        "name": "Version Control",
        "description": ["GIT", "SVN", "Github", "Gitlab", "Bit Bucket"]
      },
      {
        "name": "Prototyping Tools",
        "description": ["Figma", "Invision", "Photoshop", "Illustrator"]
      },
      {
        "name": "Planning Tools",
        "description": ["Jira", "Confluence", "Trello"]
      }
    ],
    "soft": ["Team Leadership", "Communication", "Problem Solving", "Project Management", "Agile Methodologies", "Mentoring"],
    "certifications": ["AWS Certified Solutions Architect", "Google Cloud Professional Developer", "Certified Scrum Master"]
  },
  "projects": [
    {
      "name": "EDGE 100",
      "description": "Designed for high-performers, this powerful accountability tool will help you achieve more in 100 days than you used to in an entire year. Track 7 Key Habits, Our app monitors the habits that matter most, giving you a clear daily score to measure your progress.",
      "technologies": ["Angular", "Node.js", "MySQL", "Zapier", "Google Cloud", "Ionic"],
      "url": "https://edge100app.com",
      "image": "./src/assets/proj1.png"
    },
    {
      "name": "Bottlematch",
      "description": "Explore wine, find perfect pairings, and connect with a community. Choose a recipe, and let BottleMatch find your perfect wine pairing. Connect with wine and food enthusiasts in our vibrant community.",
      "technologies": ["Angular", "Node.js", "MySQL", "Google Cloud", "Ionic"],
      "url": "https://bottlematch.com",
      "image": "./src/assets/proj2.webp"
    },
    {
      "name": "The Green Mission",
      "description": "Harnessing financial and tax resources for greener, smarter practices.",
      "technologies": ["Angular", "Node.js", "MySQL", "Google Cloud", "Ionic", "Dropbox API"],
      "url": "https://www.thegreenmissioninc.com",
      "image": "./src/assets/proj3.png"
    },
    {
      "name": "360 Response",
      "description": "Rapid Response is the most intuitive software for firefighting-response on the market. This iOS-based platform is the first software designed by firefighters for firefighters.",
      "technologies": ["Angular", "Node.js", "MySQL", "Google Cloud", "Ionic", "Google Maps API"],
      "url": "https://www.rapidresponseco.com",
      "image": "./src/assets/proj4.png"
    }
  ],
  "awards": [
    {
      "title": "Innovation Award",
      "organization": "Rapid Response Inc.",
      "date": "2021",
      "description": "Rapid Response System: Collaborated on a lifesaving app to assist NY firefighters with real-time hydrant and fire location mapping."
    },
    {
      "title": "Chrome Extensions",
      "organization": "Google Inc.",
      "date": "2018",
      "description": " Published Chrome themes/extensions with over 10,000 downloads, reflecting design and user engagement expertise."
    },
    {
      "title": "GitHub Contributions",
      "organization": "GitHub Inc.",
      "date": "2025",
      "description": "Earned badges for significant contributions to open-source projects, emphasizing collaboration and innovation."
    }
  ],
  "contact": {
    "email": "ajinkya.bijwe@gmail.com",
    "phone": "+1 (123) 456-7890",
    "website": "johndoe.dev",
    "social": {
      "linkedin": "https://linkedin.com/in/ajinkyabijwe",
      "github": "https://github.com/ajinkyabijwe",
      "twitter": "https://x.com/ajinkyabijwe",
      "dribbble": "https://dribbble.com/aju16"
    }
  }
}
